# Creates the Product Level Report
# Creates the Moving Averages for Shops

In [1]:
import pandas as pd
import os
import pyodbc as odbc

In [2]:
# Names the needed driver, server name, and database
driver_name='SQL Server'
server_name='10.0.1.218'
database='ritascoolnet_live'

In [3]:
#Creates the connection string
connection_string=f"""
DRIVER={{{driver_name}}};
SERVER={server_name};
DATABASE={database};
Trust_Connection=yes"""

In [4]:
#Creates the Connection to SQL Server
connection=odbc.connect(connection_string)
print(connection)

<pyodbc.Connection object at 0x00000171E24F9E00>

In [5]:
# Queries the tables from SQL
# Reads in the Weekly Sales in 2024
df=pd.read_sql_query('''SELECT *
  FROM [ritas_bi].[dbo].[tmp_raw_plda]
  WHERE StartDate >= '2024-12-30' ''',connection)

C:\Users\jharned\AppData\Local\Temp\ipykernel_6208\1854291108.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df=pd.read_sql_query('''SELECT *

In [6]:
os.chdir(r'G:\FinanceReports\2025\Wk3')

In [7]:
#os.chdir(r'G:\FinanceReports\2022\Wk52')

In [8]:
# df=pd.read_excel('2023-SRSsales-productLevel-wk26.xlsx', sheet_name='2023')

In [9]:
#data=pd.read_excel('2022-SRSsales-productLevel-wk1-52 1.18.2023.xlsx',sheet_name='2022')

In [10]:
#List of Shops to Exclude from Rolling up to Parent
exclude=[10511,11390,20096,20882,21360,31360]
data=df[~df.ShopID.isin(exclude)]
satellite=df[df.ShopID.isin(exclude)]
satellite['StringID']=satellite.ShopID.astype('int')

In [11]:
#Converts the Store ID to String to be able to manipulate the ID to in order to properly group Stores together
data['StringID']=data.ShopID.astype('str')
data['StringID']=data.StringID.str[-4:]
data['StringID']=data.StringID.astype('int')

In [12]:
data=pd.concat([data,satellite])

In [13]:
group=data.groupby(['StringID','Week'])['SalesMny'].sum().reset_index()

In [14]:
pivot=group.pivot_table(index='Week',columns='StringID',values='SalesMny', fill_value=0)

In [15]:
pivot.transpose()

Week               1          2          3
StringID
22        10079.0200  5758.2700  6849.0800
26         5146.6920     0.0000     0.0000
39         7082.6525  4874.9250  6146.2025
42            0.0000     0.0000     1.0000
73         7452.2425  5310.1100  6777.9550
...              ...        ...        ...
1537       4408.2270  3230.6377  3694.6092
1539       3915.8520  2343.4140  2918.3240
1542       8550.7220  6306.6330  6181.7700
1545       2208.9596  1394.8218  1749.2308
1571       6391.4990  4435.1990  4820.1605

[157 rows x 3 columns]

In [16]:
pivot.rolling(3).apply(lambda x:x[x!=0].mean()).to_excel('2025 3 Week Moving Avg.xlsx')

In [17]:
pivot.ewm(span=3).mean().to_excel('2025 3 Week Moving Avg (EMA).xlsx')

In [18]:
df.to_excel('2025-SRSsales-productLevel-wk'+str(df.Week.max())+' .xlsx',sheet_name='2025',index=False)

In [19]:
df.SalesMny.sum()

1285868.7553